/**
 * 花灵字典
 *
 * 来源：bak/main.js 第 13480 行（变量 `u`）
 * ID 范围：110001 ~ 110120（连续）
 * 用途：种植 → 花灵 → 指定花灵 的下拉选项
 */

export const ELVES: Record<string, string> = {
  '110001': '淡粉矮牵牛花灵', '110002': '紫麦冬花灵', '110003': '月白格桑花灵', '110004': '丹红蜀葵花灵',
  '110005': '殷红灯笼花灵', '110006': '飞黄玉兰花灵', '110007': '藕粉长寿花灵', '110008': '轻紫格桑花灵',
  '110009': '樱红跳舞兰花灵', '110010': '黛紫虞美人花灵', '110011': '粉樱蝶舞玫瑰花灵', '110012': '红香妃腊梅花灵',
  '110013': '香水百合花灵', '110014': '蓝色满天星花灵', '110015': '绿叶苏铁花灵', '110016': '黄色海棠花灵',
  '110017': '金盏蜀葵花灵', '110018': '烟粉格桑花灵', '110019': '幻紫铁线莲花灵', '110020': '粉黛德鸢花灵',
  '110021': '霜色麦冬花灵', '110022': '甜橙美女樱花灵', '110023': '冰蓝蝶舞玫瑰花灵', '110024': '幽蓝逐影花灵',
  '110025': '浅粉乒乓菊花灵', '110026': '忽地笑花灵', '110027': '浅粉夹竹桃花灵', '110028': '橘红海棠花花灵',
  '110029': '粉色满天星花灵', '110030': '橙黄虞美人花灵', '110031': '桃夭飞燕草花灵', '110032': '薄红虞美人花灵',
  '110033': '黛紫玉兰花灵', '110034': '紫晶灯笼花花灵', '110035': '玉玲珑腊梅花灵', '110036': '白灵逐浪花灵',
  '110037': '白鹤芋花灵', '110038': '浅紫落新妇花灵', '110039': '蓝矢车菊花灵', '110040': '白色满天星花灵',
  '110041': '丹紫夹竹桃花灵', '110042': '火蕊朱顶红花灵', '110043': '粉菲铁筷花花灵', '110044': '落霞灯笼花花灵',
  '110045': '秋枫跳舞兰花灵', '110046': '浅韵美女樱花灵', '110047': '桃影浮澜花灵', '110048': '仙女散花花灵',
  '110049': '明黄矮牵牛花灵', '110050': '水红落新妇花灵', '110051': '淡茜蜀葵花花灵', '110052': '粉矢车菊花灵',
  '110053': '紫红杜鹃花灵', '110054': '霜白海葵花灵', '110055': '黄莺蔷薇花花灵', '110056': '晴山蔷薇花花灵',
  '110057': '纯白木香花花灵', '110058': '杏绯德鸢花灵', '110059': '霁澜牡丹花灵', '110060': '姑苏雨蒙花灵',
  '110061': '浅橘乒乓菊花灵', '110062': '浅蓝落新妇花灵', '110063': '杏黄杜鹃花灵', '110064': '玫红非洲堇花灵',
  '110065': '绯雪杰奎琳花灵', '110066': '橘光朱顶红花灵', '110067': '柔蓝飞燕草花灵', '110068': '粉胭海棠花花灵',
  '110069': '春晓木香花花灵', '110070': '粉羽朱顶红花灵', '110071': '杏色春衫花灵', '110072': '紫曜牡丹花灵',
  '110073': '凤梨花花灵', '110074': '嫣红杜鹃花灵', '110075': '轻紫非洲堇花灵', '110076': '轻紫翠珠花灵',
  '110077': '火焰针垫花花灵', '110078': '白紫凌霄花花灵', '110079': '桃绯姜荷花花灵', '110080': '霁蓝紫藤花花灵',
  '110081': '暮粉紫藤花花灵', '110082': '白玉姜荷花花灵', '110083': '珠匣紫芙蓉花灵', '110084': '瑶光牡丹花灵',
  '110085': '浅白乒乓菊花灵', '110086': '紫矢车菊花灵', '110087': '淡粉非洲堇花灵', '110088': '银白翠珠花灵',
  '110089': '蜜黄针垫花花灵', '110090': '粉菲铁筷花花灵', '110091': '薄红虞美人花灵', '110092': '朱红凌霄花花灵',
  '110093': '轻紫格桑花花灵', '110094': '幻紫铁线莲花灵', '110095': '珠匣粉芙蓉花灵', '110096': '珠匣橘芙蓉花灵',
  '110097': '薄藤铁线莲花灵', '110098': '霜蓝玉簪花花灵', '110099': '桃粉报春花花灵', '110100': '杏白忘忧草花灵',
  '110101': '淡紫仙客来花灵', '110102': '盈粉芍药花灵', '110103': '暮山耧斗菜花灵', '110104': '松绿立金花花灵',
  '110105': '素雪瑞香花花灵', '110106': '缃黄瑞香花花灵', '110107': '沐光映黄月季花灵', '110108': '映粉云光月季花灵',
  '110109': '迎春花花灵', '110110': '丹红蜀葵花花灵', '110111': '浅蓝仙客来花灵', '110112': '浅粉仙客来花灵',
  '110113': '紫晶玉簪花花灵', '110114': '朝晖姜荷花花灵', '110115': '丹红耧斗菜花灵', '110116': '杏黄立金花花灵',
  '110117': '彤云六初花花灵', '110118': '烟紫瑞香花花灵', '110119': '冰蓝蝶舞玫瑰花灵', '110120': '橙光拂晓月季花灵',
}

export const elfOptions = Object.entries(ELVES).map(([value, label]) => ({ value, label }))
